---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.StructuralConnectionApplyTo.BeamsAndBraces
enum: Autodesk.Revit.DB.Structure.StructuralConnectionApplyTo
source: html/2d0e55f6-fbb5-a5c6-2423-6bb4e759d56e.htm
---
# Autodesk.Revit.DB.Structure.StructuralConnectionApplyTo.BeamsAndBraces

Designate a StructuralConnectionType to apply to beams and braces.